dannyvondenhoerbergen/micropython/ports/tm4c123/mods/i2c.c
    // specify that we want to communicate to device address with an intended write to bus
    // set bitrate to 100 kHz
    I2CMasterSlaveAddrSet(self->i2c_base, device_address, false);

    // make sure no other Master is currently using the BUS
    // while(I2CMasterBusBusy(self->i2c_base));

    err_code = I2CMasterErr(self->i2c_base);
    mp_printf(MP_PYTHON_PRINTER, "error code %d\n", err_code);

    // if BUS is free and no errors occured, proceed
    if (err_code == I2C_MASTER_ERR_NONE)
    {
        // single send routine
        if (size == 1)
        {
            mp_printf(MP_PYTHON_PRINTER, "single send\nsize of data buffer: %d\n", size);
            // memory location to be written to
            I2CMasterDataPut(self->i2c_base, *(device_data));

            // send start condition, address byte and bit for write direction to slave device
            I2CMasterControl(self->i2c_base, I2C_MASTER_CMD_SINGLE_SEND);

            // wait for Master Control Unit to finish transaction
            while (I2CMasterBusy(self->i2c_base))
            {
                // mp_printf(MP_PYTHON_PRINTER, "Master Busy: %d\n", I2CMasterBusy(self->i2c_base));
            }

            // check for errors
            if (I2CMasterErr(self->i2c_base))
            {
                // return error code
                err_code = I2CMasterErr(self->i2c_base);
                mp_printf(MP_PYTHON_PRINTER, "ERROR CODE: %d\n", err_code);
                // nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "data transfer failed\n"));
            }
            // end transfer
            return;
        }
        else
        {
            if (mem_loc_flag)
            {
                mp_printf(MP_PYTHON_PRINTER, "register address send reached\nsize of data buffer: %d\n", size);
                // memory location to be written to
                I2CMasterDataPut(self->i2c_base, mem_loc);

                // send start condition, address byte and bit for write direction to slave device
                I2CMasterControl(self->i2c_base, I2C_MASTER_CMD_BURST_SEND_START);

                // wait for Master Control Unit to finish transaction
                while (I2CMasterBusy(self->i2c_base))
                {
                }

                // check for errors
                if (I2CMasterErr(self->i2c_base))
                {
                    // if error occured, cancel write routine
                    I2CMasterControl(self->i2c_base, I2C_MASTER_CMD_BURST_SEND_ERROR_STOP);

                    // return error code
                    nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "data transfer failed - memory location unkown\n"));
                }
            }
            else
            {

                mp_printf(MP_PYTHON_PRINTER, "write function data buffer reached\nsize of data buffer: %d\n", size);
                // write data to FIFO
                I2CMasterDataPut(self->i2c_base, *(device_data++));

                // send data to the slave
                I2CMasterControl(self->i2c_base, I2C_MASTER_CMD_BURST_SEND_START);

                // wait for Master Control Unit to finish transaction
                while (I2CMasterBusy(self->i2c_base))
                {
                }

                // check for errors
                if (I2CMasterErr(self->i2c_base))
                {
                    // if error occured, cancel write routine
                    I2CMasterControl(self->i2c_base, I2C_MASTER_CMD_BURST_SEND_ERROR_STOP);

                    // return error code
                    nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "data transfer failed\n"));
                }
            }

            // send payload
            for (size_t i = 1; i < size; i++)
            {
                mp_printf(MP_PYTHON_PRINTER, "rest of buffer write reached\nsize of data buffer: %d\n", size);
                // last byte?
                if (i == (size - 1))
                {
                    // data to be send
                    I2CMasterDataPut(self->i2c_base, *device_data);

                    // send desired memory location to the slave (can be anything)
                    I2CMasterControl(self->i2c_base, I2C_MASTER_CMD_BURST_SEND_FINISH);

                    // wait for Master Control Unit to finish transaction
                    while (I2CMasterBusy(self->i2c_base))
                    {
                    }

                    // check for errors
                    if (I2CMasterErr(self->i2c_base))
                    {
                        // if error occured, cancel write routine
                        I2CMasterControl(self->i2c_base, I2C_MASTER_CMD_BURST_SEND_ERROR_STOP);

                        // return error code
                        nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "data transfer failed\n"));
                    }

                    // transfer finished
                    return;
                }
                // write data to FIFO
                I2CMasterDataPut(self->i2c_base, *(device_data++));

                // send data to the slave
                I2CMasterControl(self->i2c_base, I2C_MASTER_CMD_BURST_SEND_CONT);

                // wait for Master Control Unit to finish transaction
                while (I2CMasterBusy(self->i2c_base))
                {
                }

                // check for errors
                if (I2CMasterErr(self->i2c_base))
                {
                    // if error occured, cancel write routine
                    I2CMasterControl(self->i2c_base, I2C_MASTER_CMD_BURST_SEND_ERROR_STOP);

                    // return error code
                    nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "data transfer failed\n"));
                }
            }
        }
    }
}

STATIC uint8_t initialize_i2c_bus_read(mp_obj_t *self_in, uint32_t device_address)
{
    uint8_t err_code;
    machine_hard_i2c_obj_t *self = (machine_hard_i2c_obj_t *)self_in;

