dannyvondenhoerbergen/micropython/ports/tm4c123/mods/i2c.c
// mp-c interface readinto
STATIC mp_obj_t mp_machine_hard_i2c_readinto(size_t n_args, const mp_obj_t *args, mp_map_t *kw_args)
{
    // cast values and check arguments
    enum
    {
        ARG_buf,
        ARG_nack
    };
    static const mp_arg_t allowed_args[] = {
        {MP_QSTR_buf, MP_ARG_REQUIRED | MP_ARG_OBJ, {.u_obj = MP_OBJ_NULL}}, // buffer pointer - default: NULL
        {MP_QSTR_nack, MP_ARG_KW_ONLY | MP_ARG_BOOL, {.u_bool = true}},      // NACK bool - default: True
    };

    mp_arg_val_t args_local[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args, &args[1], kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args_local);

    // get read buffer pointer from mp
    mp_buffer_info_t i2c_read_buf;
    mp_get_buffer_raise(args_local, &i2c_read_buf, MP_BUFFER_WRITE);

    // get nack flag from mp
    uint8_t nack = mp_obj_get_int(kw_args);

    // go to c-interface
    machine_hard_i2c_readinto(args[0], (uint8_t *)i2c_read_buf.buf, i2c_read_buf.len, nack);

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_KW(mp_machine_hard_i2c_readinto_obj, 2, mp_machine_hard_i2c_readinto);

// mp-c interface readinto
STATIC mp_obj_t mp_machine_hard_i2c_readfrom(size_t n_args, const mp_obj_t *args)
{
    if (n_args == 4)
    {
        // casting Micropython data types to c data types
        uint16_t int_dev_address = mp_obj_get_int(args[1]);
        mp_printf(MP_PYTHON_PRINTER, "device address: %d\n", int_dev_address);
        uint16_t int_nbytes = mp_obj_get_int(args[2]);
        mp_printf(MP_PYTHON_PRINTER, "nbytes: %d\n", int_nbytes);
        uint16_t int_stop = mp_obj_get_int(args[3]);
        mp_printf(MP_PYTHON_PRINTER, "stop-condition: %d\n", int_stop);

        // calling I2C-Read Function
        vstr_t vstr;
        vstr_init_len(&vstr, int_nbytes);
        if(int_nbytes == 1)
        {
            *vstr.buf = i2c_single_read(args[0], int_dev_address);
        }
        else
        {
            uint8_t local_buffer[int_nbytes];
            vstr.buf = (char *)&local_buffer[0];
            local_buffer[0] = initialize_i2c_bus_read(args[0], int_dev_address);
            
            if(int_stop == 1)
            {
                i2c_read_bytes_from_bus(args[0], &local_buffer[1], int_nbytes-2);
                local_buffer[int_nbytes] = terminate_i2c_bus_read(args[0]);
            }
            else
            {
                i2c_read_bytes_from_bus(args[0], &local_buffer[1], int_nbytes-1);
            }
        }
        
        return mp_obj_new_str_from_vstr(&mp_type_bytes, &vstr);
    }
    else
    {
        nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "Wrong number of arguments\n"));
    }

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mp_machine_hard_i2c_readfrom_obj, 4, 4, mp_machine_hard_i2c_readfrom);

/* DeInit Function */

STATIC mp_obj_t i2c_deinit(mp_obj_t self_in)
{
    deinitI2C0(&self_in);

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(i2c_deinit_obj, i2c_deinit);

STATIC mp_obj_t machine_hard_i2c_init(size_t n_args, const mp_obj_t *args, mp_map_t *kw_args)
{
    return machine_hard_i2c_init_helper(args[0], n_args - 1, args + 1, kw_args);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_KW(machine_i2c_init_obj, 1, machine_hard_i2c_init);

/*
	Define uPy-Fuctions
*/

/*
	Table with all globals
*/
STATIC const mp_rom_map_elem_t machine_hard_i2c_locals_dict_table[] = {
    // methods
    {MP_OBJ_NEW_QSTR(MP_QSTR___name__), MP_OBJ_NEW_QSTR(MP_QSTR_i2c)},
    {MP_OBJ_NEW_QSTR(MP_QSTR_init), MP_ROM_PTR(&machine_i2c_init_obj)},
    {MP_OBJ_NEW_QSTR(MP_QSTR_writeto), MP_ROM_PTR(&mp_machine_hard_i2c_writeto_obj)},
    {MP_OBJ_NEW_QSTR(MP_QSTR_writeto_mem), MP_ROM_PTR(&mp_machine_hard_i2c_writeto_mem_obj)},
    {MP_OBJ_NEW_QSTR(MP_QSTR_readinto), MP_ROM_PTR(&mp_machine_hard_i2c_readinto_obj)},
    {MP_OBJ_NEW_QSTR(MP_QSTR_readfrom), MP_ROM_PTR(&mp_machine_hard_i2c_readfrom_obj)},
    {MP_OBJ_NEW_QSTR(MP_QSTR_deinit), MP_ROM_PTR(&i2c_deinit_obj)},

    // constants
    {MP_ROM_QSTR(MP_QSTR_MASTER), MP_ROM_INT(I2C_MODE_MASTER)},
    {MP_ROM_QSTR(MP_QSTR_SLAVE), MP_ROM_INT(I2C_MODE_SLAVE)},
};

/*
	Define all globals as uPy-globals
*/
STATIC MP_DEFINE_CONST_DICT(machine_hard_i2c_locals_dict, machine_hard_i2c_locals_dict_table);

mp_obj_t machine_hard_i2c_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *all_args)
{

    // check arguments
    mp_arg_check_num(n_args, n_kw, 1, MP_OBJ_FUN_ARGS_MAX, true);

    // find I2C port
    i2c_id_t i2c_id = i2c_find(all_args[0]);

    // create dynamic peripheral object
    machine_hard_i2c_obj_t *self;

    // get SPI object
    if (MP_STATE_PORT(machine_i2c_obj_all)[i2c_id - 1] == NULL)
    {
        // create new I2C object
        self = m_new0(machine_hard_i2c_obj_t, 1);
        self->base.type = &machine_hard_i2c_type;
        self->i2c_id = i2c_id;
        MP_STATE_PORT(machine_i2c_obj_all)
        [i2c_id - 1] = self;
    }
    else
    {
        // reference existing I2C object
        self = MP_STATE_PORT(machine_i2c_obj_all)[i2c_id - 1];
    }

    if (n_args > 1 || n_kw > 0)
    {
        // start the peripheral
        mp_map_t kw_args;
        mp_map_init_fixed_table(&kw_args, n_kw, all_args + n_args);
        mp_obj_t *self_out = (mp_obj_t *)self;
        machine_hard_i2c_init_helper(self_out, n_args - 1, all_args + 1, &kw_args);
    }

    return MP_OBJ_FROM_PTR(self);
}

const mp_obj_type_t machine_hard_i2c_type = {
    {&mp_type_type},
    .name = MP_QSTR_I2C,
    .print = machine_hard_i2c_print,
    .make_new = machine_hard_i2c_make_new,
    .locals_dict = (mp_obj_t)&machine_hard_i2c_locals_dict,
};
